solution_verification/simplified_edds_model/co-refinement_study/simulation_setup/template/constant/caseSolid/fvModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/caseSolid";
    object      fvModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

energySource
{
    type            heatSource;

    selectionMode   all;

    q               7e7; 
//   {
//	type              tableFile;
//	format	          csv;
//	nHeaderLine       1;
//        refColumn    	  0;
//	componentColumns  (1);
//	separator	  ",";
//	mergeSeparators   no;
 //	file 		  "constant/caseSolid/sample1";
//    }
}

// ************************************************************************* //

