solution_verification/simplified_edds_model/co-refinement_study/simulation_setup/template/0/pipeFluid/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version: 9 
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0/fluid";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    #includeEtc "caseDicts/setConstraintTypes"

    pipeFluid_to_caseSolid
    {
        type            noSlip;
    }
    wallin
    {
        type            noSlip;
    }
    wallpm
    {
        type            noSlip;
    }
    inlet
    {
        type            fixedValue;
        value           uniform (0 0 0.521646); //0.63); //0.521646);
    }
    outlet
    {
        type            zeroGradient; // fixedValue;
	// value 		uniform (0 0 0);
    }
}


// ************************************************************************* //
